check = {'0':0,'1':1 , '2':2, '3':3, '4':4, '5':5, '6':6, '7':7, '8':8, '9':9,
     'A':10, 'B':11, 'C':12, 'D':13, 'E':14, 'F':15, 'G':16, 'H':17,
     'I':18, 'J':19, 'K':20, 'L':21, 'M':22, 'N':23, 'O':24, 'P':25,
     'Q':26, 'R':27, 'S':28, 'T':29, 'U':30, 'V':31, 'W':32, 'X':33, 'Y':34, 'Z':35}

n, b = input().split()
result = 0
a = len(n)

for i in range(a) :
    # 값 * n의 거듭제곱
    result += check[n[i]] * (int(b)**(a-i-1)) # b의 (길이-1)승

print(result)

# int (n , b) 문자열 n을 b진법 숫자로 -> 10진수로 변환해주는 함수..
# print(int(n, int(b)))